tutorials/lagrangian/MPPICFoam/injectionChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    ( 0                -3                 -0.5)
    ( 2                -3                 -0.5)
    ( 0                -3.727940468532405 -0.5)
    ( 0.34202014332567 -4.667633089318313 -0.5)
    ( 2.34202014332567 -3.939692620785910 -0.5)
    ( 4.92380440016309 -3                 -0.5)
    (41                -3                 -0.5)
    (41                -6                 -0.5)
    (53                -6                 -0.5)
    (53                -3                 -0.5)
    (53                 3                 -0.5)
    (53                 6                 -0.5)
    (41                 6                 -0.5)
    (41                 3                 -0.5)
    ( 4.92380440016309  3                 -0.5)
    ( 2.34202014332567  3.939692620785910 -0.5)
    ( 0.34202014332567  4.667633089318313 -0.5)
    ( 0                 3.727940468532405 -0.5)
    ( 2                 3                 -0.5)
    ( 0                 3                 -0.5)
    ( 3.46190220008154 -2.3               -0.5)
    ( 3.46190220008154  2.3               -0.5)
    ( 0                -3                  0.5)
    ( 2                -3                  0.5)
    ( 0                -3.727940468532405  0.5)
    ( 0.34202014332567 -4.667633089318313  0.5)
    ( 2.34202014332567 -3.939692620785910  0.5)
    ( 4.92380440016309 -3                  0.5)
    (41                -3                  0.5)
    (41                -6                  0.5)
    (53                -6                  0.5)
    (53                -3                  0.5)
    (53                 3                  0.5)
    (53                 6                  0.5)
    (41                 6                  0.5)
    (41                 3                  0.5)
    ( 4.92380440016309  3                  0.5)
    ( 2.34202014332567  3.939692620785910  0.5)
    ( 0.34202014332567  4.667633089318313  0.5)
    ( 0                 3.727940468532405  0.5)
    ( 2                 3                  0.5)
    ( 0                 3                  0.5)
    ( 3.46190220008154 -2.3                0.5)
    ( 3.46190220008154  2.3                0.5)
);

blocks
(
    hex ( 0  1 18 19 22 23 40 41) ( 4 34  2) simpleGrading (1 1 1)
    hex ( 1 20 21 18 23 42 43 40) ( 7 34  2) simpleGrading (1 1 1)
    hex (20  5 14 21 42 27 36 43) ( 7 34  2) simpleGrading (1 1 1)
    hex ( 5  6 13 14 27 28 35 36) (72 34  2) simpleGrading (1 1 1)
    hex ( 6  9 10 13 28 31 32 35) (24 34  2) simpleGrading (1 1 1)

    hex ( 7  8  9  6 29 30 31 28) (24 17  2) simpleGrading (1 1 1)
    hex (13 10 11 12 35 32 33 34) (24 17  2) simpleGrading (1 1 1)

    hex ( 3  4  1  2 25 26 23 24) ( 7  7  2) simpleGrading (1 1 1)
    hex ( 4  5 20  1 26 27 42 23) ( 7  7  2) simpleGrading (1 1 1)
    hex (18 21 14 15 40 43 36 37) ( 7  7  2) simpleGrading (1 1 1)
    hex (17 18 15 16 39 40 37 38) ( 7  7  2) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            ( 0  1 23 22)
            ( 1  2 24 23)

            ( 3  4 26 25)
            ( 4  5 27 26)
            ( 5  6 28 27)
            ( 6  7 29 28)
            ( 7  8 30 29)

            (11 12 34 33)
            (12 13 35 34)
            (13 14 36 35)
            (14 15 37 36)
            (15 16 38 37)

            (17 18 40 39)
            (18 19 41 40)
            (19  0 22 41)
        );
    }

    lowerInlet
    {
        type patch;
        faces
        (
            (2 3 25 24)
        );
    }

    upperInlet
    {
        type patch;
        faces
        (
            (16 17 39 38)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (8 9 31 30)
            (9 10 32 31)
            (10 11 33 32)
        );
    }

    frontAndBack
    {
        type symmetry;
        faces
        (
            ( 0  1 18 19)
            ( 1 20 21 18)
            (20  5 14 21)
            ( 5  6 13 14)
            ( 6  9 10 13)

            ( 7  8  9  6)
            (13 10 11 12)

            ( 3  4  1  2)
            ( 4  5 20  1)
            (18 21 14 15)
            (17 18 15 16)

            (22 23 40 41)
            (23 42 43 40)
            (42 27 36 43)
            (27 28 35 36)
            (28 31 32 35)

            (29 30 31 28)
            (35 32 33 34)

            (25 26 23 24)
            (26 27 42 23)
            (40 43 36 37)
            (39 40 37 38)
        );
    }
);

// ************************************************************************* //
